---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPSection.Velocity
source: html/f8f59184-74bb-446c-8da7-d2f16c500caf.htm
---
# Autodesk.Revit.DB.Mechanical.MEPSection.Velocity Property

The velocity of the section.

## Syntax (C#)
```csharp
public double Velocity { get; }
```

## Remarks
In one section, all section members have same velocity.
 Default unit is Feet per second.
 For Duct, unit type is UT_HVAC_Velocity.
 For Pipe, unit type is UT_Piping_Velocity